#+layout: post
#+title: Mathematica and Math Modeling
#+date: 2023-2-16
#+options: _:nil ^:nil
#+math: true
#+categories: mathematica
** Maximize & Minmize
[[https://www.wolfram.com/language/core-areas/optimization/][Wolfram Optimization]]:
+ [[https://reference.wolfram.com/language/ref/LinearOptimization.html][LinearOptimization]] 适用于线性约束问题下的线性函数的最小值的查找.

  #+name: linearoptimization
  #+begin_src mathematica :results value pp
    LinearOptimization[x + y, {x + 2 * y == 3, x >= 0, y >= 0}, {x, y}]
  #+end_src

  #+RESULTS: linearoptimization
  : {x -> 0, y -> 3/2}

  剩下的两个函数和其语法类似, 代码略. 
+ [[https://reference.wolfram.com/language/ref/FindMinimum.html][FindMinimum]] 适用于寻找邻域内的局部最小值, 寻找的方式有点像是贪心算法.
+ [[https://reference.wolfram.com/language/ref/Minimize.html][Minimize]] 适用于寻找全局的最小值

  (注: 该函数对于 *非常多* 的变量的效果并不是很好.
  +虽然我觉得我也没有可能遇到这种情况就是了...+)

#+begin_html
<details><summary>一个比较炫酷的例子</summary>
#+end_html

可以使用 [[https://reference.wolfram.com/language/ref/StepMonitor.html][StepMonitor]] 配合 [[https://reference.wolfram.com/language/ref/Sow.html][Sow]] 和 [[https://reference.wolfram.com/language/ref/Reap.html][Reap]] 来捕捉每一步具体的过程,
可以用于计算和绘制查找最小值的过程:

#+begin_src mathematica
  With[{exp = (1 - x)^2 + 100*(-x^2 - y)^2 ,
    xrange = {x, -1.5, 1.5}, yrange = {y, -1.5, 1.5}},
   With[{res = Reap[NMinimize[exp, {x, y}, StepMonitor :> Sow[{x, y}]]]},
    With[{path = res[[2, 1]], minValue = res[[1, 1]]},
     ContourPlot[exp, xrange, yrange,
      Epilog -> {Arrow[path], Point[path]},
      Contours -> Table[10^-i, {i, -2, 10}],
      ColorFunction -> (Hue[(Log[10, #] + 10)/12] &),
      ColorFunctionScaling -> False,
      ImageSize -> Medium]
     ]]]
#+end_src

参考的是官方文档的 [[https://reference.wolfram.com/language/ref/NMinimize?view=all#151017442][StepMonitor]] 的例子.
可能需要重新修改一下关于着色的函数. 

#+begin_html
</details>
#+end_html

*** TOPSIS
[[https://en.wikipedia.org/wiki/TOPSIS][TOPSIS | Wikipedia]] 计算正负理想解以距离其距离正负理想解的距离来作为判断因素
+ [[https://reference.wolfram.com/language/ref/Max.html][Max]], [[https://reference.wolfram.com/language/ref/Min.html][Min]] 用于计算正负理想解
+ [[https://reference.wolfram.com/language/ref/EuclideanDistance.html][EuclideanDistance]] 用于计算距离 (其他的距离函数可以考虑 =?*Distance=)

#+begin_html
<details><summary>一个可行的代码</summary>
#+end_html

设数据的类型类似如下形式:

#+name: topsis-example-data
#+begin_src mathematica :exports both
  data = Table[Table[RandomInteger[5], {i, 2}], {j, 3}]
#+end_src

#+RESULTS: topsis-example-data
| 4 | 4 |
| 4 | 0 |
| 4 | 1 |

+ 计算正规化 (normalization) 数据的函数:

  #+name: topsis-normalization-func
  #+begin_src mathematica
    normalData[data0_] := With[{ data = Transpose[data0] },
      Transpose[(# / Sqrt[Total[#^2& /@ #]]) & /@ data]];
  #+end_src
+ 如果需要安排权值 $w_i$, 那么考虑:

  #+name: topsis-weight-assigning
  #+begin_src mathematica
    weightAssignData[data_, weight_] := MapThread[#1 * #2&, {#, weight}]& /@ data;
  #+end_src
+ 计算正负理想解的函数:

  #+name: topsis-worst-best-alternatives
  #+begin_src mathematica
    worstAlternative[data0_] := With[{ data = Transpose[data0] }, Min /@ data];
    bestAlternative[data0_] := With[{ data = Transpose[data0] }, Max /@ data];
  #+end_src
+ 最后使用距离函数, 并通过距离函数来评价:

  #+name: topsis-rankfunc
  #+begin_src mathematica
    rankData[data_] := With[{ worst = worstAlternative[data], best = bestAlternative[data] },
      SortBy[data, {EuclideanDistance[best, #]&, EuclideanDistance[worst, #]&}]];
  #+end_src

#+begin_html
</details>
#+end_html
